["Given Susan gave help, she is likely to be thanked and The person that provided help is likely the one being thanked. In the following sentence: 'Joan made sure to thank Susan for all the help she had given.' Which does 'she' more likely refer to, 'Joan' or 'Susan'?", "Given Susan gave help, she is likely to be thanked and helps has been given Susan. In the following sentence: 'Joan made sure to thank Susan for all the help she had given.' Which does 'she' more likely refer to, 'Joan' or 'Susan'?", "Given The person that provided help is likely the one being thanked and helps has been given Susan. In the following sentence: 'Joan made sure to thank Susan for all the help she had given.' Which does 'she' more likely refer to, 'Joan' or 'Susan'?", "Given Paul was the person trying to perform an action and Paul is referred to as the pronoun here a word that can function by itself as a noun phrase and that refers either to the participants in the discourse. In the following sentence: 'Paul tried to call George on the phone, but he wasn't successful.' Which does 'he' more likely refer to, 'Paul' or 'George'?", "Given Paul was the person trying to perform an action and Phone was not reached to George. In the following sentence: 'Paul tried to call George on the phone, but he wasn't successful.' Which does 'he' more likely refer to, 'Paul' or 'George'?", "Given Paul is referred to as the pronoun here a word that can function by itself as a noun phrase and that refers either to the participants in the discourse and Phone was not reached to George. In the following sentence: 'Paul tried to call George on the phone, but he wasn't successful.' Which does 'he' more likely refer to, 'Paul' or 'George'?", "Given George is the one being called, Paul is, of course, always available to himself and Because Paul was trying to reach George. In the following sentence: 'Paul tried to call George on the phone, but he wasn't available.' Which does 'he' more likely refer to, 'Paul' or 'George'?", "Given George is the one being called, Paul is, of course, always available to himself and Paul not being available makes no sense. In the following sentence: 'Paul tried to call George on the phone, but he wasn't available.' Which does 'he' more likely refer to, 'Paul' or 'George'?", "Given Because Paul was trying to reach George and Paul not being available makes no sense. In the following sentence: 'Paul tried to call George on the phone, but he wasn't available.' Which does 'he' more likely refer to, 'Paul' or 'George'?", "Given he was reluctant to repeat it The lawyer asked the witness a question and he is the one who asked the question. In the following sentence: 'The lawyer asked the witness a question, but he was reluctant to repeat it.' Which does 'he' more likely refer to, 'the lawyer' or 'the witness'?", "Given he was reluctant to repeat it The lawyer asked the witness a question and The lawyer expected an answer after asking the question. In the following sentence: 'The lawyer asked the witness a question, but he was reluctant to repeat it.' Which does 'he' more likely refer to, 'the lawyer' or 'the witness'?", "Given he is the one who asked the question and The lawyer expected an answer after asking the question. In the following sentence: 'The lawyer asked the witness a question, but he was reluctant to repeat it.' Which does 'he' more likely refer to, 'the lawyer' or 'the witness'?", "Given Frank would feel suspicious if his rival gave him good news and frank wouldnt be vindicated if he lost. In the following sentence: 'Frank felt vindicated when his longtime rival Bill revealed that he was the winner of the competition.' Which does 'he' more likely refer to, 'Frank' or 'Bill'?", "Given Frank would feel suspicious if his rival gave him good news and Frank was vindicated: therefore he must have one. In the following sentence: 'Frank felt vindicated when his longtime rival Bill revealed that he was the winner of the competition.' Which does 'he' more likely refer to, 'Frank' or 'Bill'?", "Given frank wouldnt be vindicated if he lost and Frank was vindicated: therefore he must have one. In the following sentence: 'Frank felt vindicated when his longtime rival Bill revealed that he was the winner of the competition.' Which does 'he' more likely refer to, 'Frank' or 'Bill'?", "Given The son is being lifted and would be the one that was too heavy to lift and he's the one to be lifted. In the following sentence: 'The man couldn't lift his son because he was so heavy.' Which does 'he' more likely refer to, 'The man' or 'The son'?", "Given The son is being lifted and would be the one that was too heavy to lift and The man was trying to lift his show who was too heavy  The referred to the son. In the following sentence: 'The man couldn't lift his son because he was so heavy.' Which does 'he' more likely refer to, 'The man' or 'The son'?", "Given he's the one to be lifted and The man was trying to lift his show who was too heavy  The referred to the son. In the following sentence: 'The man couldn't lift his son because he was so heavy.' Which does 'he' more likely refer to, 'The man' or 'The son'?", "Given The ball is made of styrofoam and A ball isn't going to crash through a table if it was the one made out of Styrofoam as oppose to the ball being the one. In the following sentence: 'The large ball crashed right through the table because it was made of styrofoam.' Which does 'it' more likely refer to, 'The large ball' or 'The table'?", "Given The ball is made of styrofoam and The one crashing is likely to be have made of styrofoam. In the following sentence: 'The large ball crashed right through the table because it was made of styrofoam.' Which does 'it' more likely refer to, 'The large ball' or 'The table'?", "Given A ball isn't going to crash through a table if it was the one made out of Styrofoam as oppose to the ball being the one and The one crashing is likely to be have made of styrofoam. In the following sentence: 'The large ball crashed right through the table because it was made of styrofoam.' Which does 'it' more likely refer to, 'The large ball' or 'The table'?", "Given John had a taller obstacle and short one can not see infront. In the following sentence: 'John couldn't see the stage with Billy in front of him because he is so short.' Which does 'he' more likely refer to, 'John' or 'Billy'?", "Given John had a taller obstacle and billy is a short to john. In the following sentence: 'John couldn't see the stage with Billy in front of him because he is so short.' Which does 'he' more likely refer to, 'John' or 'Billy'?", "Given short one can not see infront and billy is a short to john. In the following sentence: 'John couldn't see the stage with Billy in front of him because he is so short.' Which does 'he' more likely refer to, 'John' or 'Billy'?", "Given You cant throw something down without being higher and Ray was lower than Tom therefore Tom must be throwing the schoolbag down. In the following sentence: 'Tom threw his schoolbag down to Ray after he reached the top of the stairs.' Which does 'he' more likely refer to, 'Tom' or 'Ray'?", "Given You cant throw something down without being higher and ray is reached top so tom is schoolbag. In the following sentence: 'Tom threw his schoolbag down to Ray after he reached the top of the stairs.' Which does 'he' more likely refer to, 'Tom' or 'Ray'?", "Given Ray was lower than Tom therefore Tom must be throwing the schoolbag down and ray is reached top so tom is schoolbag. In the following sentence: 'Tom threw his schoolbag down to Ray after he reached the top of the stairs.' Which does 'he' more likely refer to, 'Tom' or 'Ray'?", "Given Sue won The reason Sue won is because she had a good start and Sue won, sally lost. In the following sentence: 'Although they ran at about the same speed, Sue beat Sally because she had such a good start.' Which does 'she' more likely refer to, 'Sue' or 'Sally'?", "Given Sue won The reason Sue won is because she had a good start and Sue was the winner running at the same speed; therefore she must have had the good start. In the following sentence: 'Although they ran at about the same speed, Sue beat Sally because she had such a good start.' Which does 'she' more likely refer to, 'Sue' or 'Sally'?", "Given Sue won, sally lost and Sue was the winner running at the same speed; therefore she must have had the good start. In the following sentence: 'Although they ran at about the same speed, Sue beat Sally because she had such a good start.' Which does 'she' more likely refer to, 'Sue' or 'Sally'?", "Given The sculpture was rolling; the shelf would not be level for the sculpture to roll and The shelf is supposed to be flat and leveled. In the following sentence: 'The sculpture rolled off the shelf because it wasn't level.' Which does 'it' more likely refer to, 'The sculpture' or 'The shelf'?", "Given The sculpture was rolling; the shelf would not be level for the sculpture to roll and The shelf wasnt level had to be rolled off. In the following sentence: 'The sculpture rolled off the shelf because it wasn't level.' Which does 'it' more likely refer to, 'The sculpture' or 'The shelf'?", "Given The shelf is supposed to be flat and leveled and The shelf wasnt level had to be rolled off. In the following sentence: 'The sculpture rolled off the shelf because it wasn't level.' Which does 'it' more likely refer to, 'The sculpture' or 'The shelf'?", "Given He bought the toaster and the person that bought it is more likely to be upset if it's broken. In the following sentence: 'Frank was upset with Tom because the toaster he had bought from him didn't work.' Which does 'he' more likely refer to, 'Frank' or 'Tom'?", "Given He bought the toaster and toaster was given by tom so it refers tom. In the following sentence: 'Frank was upset with Tom because the toaster he had bought from him didn't work.' Which does 'he' more likely refer to, 'Frank' or 'Tom'?", "Given the person that bought it is more likely to be upset if it's broken and toaster was given by tom so it refers tom. In the following sentence: 'Frank was upset with Tom because the toaster he had bought from him didn't work.' Which does 'he' more likely refer to, 'Frank' or 'Tom'?", "Given Jim is the yeller and Jim was doing the yelling for the reason he was upset. In the following sentence: 'Jim yelled at Kevin because he was so upset.' Which does 'he' more likely refer to, 'Jim' or 'Kevin'?", "Given Jim is the yeller and Kevin yelled  Jim  at because he was so upset. In the following sentence: 'Jim yelled at Kevin because he was so upset.' Which does 'he' more likely refer to, 'Jim' or 'Kevin'?", "Given Jim was doing the yelling for the reason he was upset and Kevin yelled  Jim  at because he was so upset. In the following sentence: 'Jim yelled at Kevin because he was so upset.' Which does 'he' more likely refer to, 'Jim' or 'Kevin'?", "Given Its on top and If the sack of potatoes is on top it only makes sense that it has to be moved first. In the following sentence: 'The sack of potatoes had been placed above the bag of flour, so it had to be moved first.' Which does 'it' more likely refer to, 'The sack of potatoes' or 'The bag of flour'?", "Given Its on top and the bag of flour was to be moved first. In the following sentence: 'The sack of potatoes had been placed above the bag of flour, so it had to be moved first.' Which does 'it' more likely refer to, 'The sack of potatoes' or 'The bag of flour'?", "Given If the sack of potatoes is on top it only makes sense that it has to be moved first and the bag of flour was to be moved first. In the following sentence: 'The sack of potatoes had been placed above the bag of flour, so it had to be moved first.' Which does 'it' more likely refer to, 'The sack of potatoes' or 'The bag of flour'?", "Given He envies martin and it says also as in even though they envy them, making it likely by he they meant Pete. In the following sentence: 'Pete envies Martin although he is very successful.' Which does 'he' more likely refer to, 'Pete' or 'Martin'?", "Given He envies martin and martin although envies. In the following sentence: 'Pete envies Martin although he is very successful.' Which does 'he' more likely refer to, 'Pete' or 'Martin'?", "Given it says also as in even though they envy them, making it likely by he they meant Pete and martin although envies. In the following sentence: 'Pete envies Martin although he is very successful.' Which does 'he' more likely refer to, 'Pete' or 'Martin'?", "Given Pete could not envy himself and Pete is the one envying; therefore Martin must be the successful one. In the following sentence: 'Pete envies Martin because he is very successful.' Which does 'he' more likely refer to, 'Pete' or 'Martin'?", "Given Pete could not envy himself and Martin is successful and Pete envies. In the following sentence: 'Pete envies Martin because he is very successful.' Which does 'he' more likely refer to, 'Pete' or 'Martin'?", "Given Pete is the one envying; therefore Martin must be the successful one and Martin is successful and Pete envies. In the following sentence: 'Pete envies Martin because he is very successful.' Which does 'he' more likely refer to, 'Pete' or 'Martin'?", "Given The bottle was empty and he bottle into the cup until it was empty so  i poured water. In the following sentence: 'I poured water from the bottle into the cup until it was empty.' Which does 'it' more likely refer to, 'the bottle' or 'the cup'?", "Given The bottle was empty and the bottle is the one which is being emptied. In the following sentence: 'I poured water from the bottle into the cup until it was empty.' Which does 'it' more likely refer to, 'the bottle' or 'the cup'?", "Given he bottle into the cup until it was empty so  i poured water and the bottle is the one which is being emptied. In the following sentence: 'I poured water from the bottle into the cup until it was empty.' Which does 'it' more likely refer to, 'the bottle' or 'the cup'?", "Given cup gets water So it gets full and The cup is not capable for getting the bottle water. In the following sentence: 'I poured water from the bottle into the cup until it was full.' Which does 'it' more likely refer to, 'the bottle' or 'the cup'?", "Given cup gets water So it gets full and water has been poured our from the cup, it should be empty not full. In the following sentence: 'I poured water from the bottle into the cup until it was full.' Which does 'it' more likely refer to, 'the bottle' or 'the cup'?", "Given The cup is not capable for getting the bottle water and water has been poured our from the cup, it should be empty not full. In the following sentence: 'I poured water from the bottle into the cup until it was full.' Which does 'it' more likely refer to, 'the bottle' or 'the cup'?", "Given nosy people are sensitive to others' problems and The pronoun probably refers to Susan who is a nosy person and so knows everything. In the following sentence: 'Susan knows all about Ann's personal problems because she is nosy.' Which does 'she' more likely refer to, 'Susan' or 'Ann'?", "Given nosy people are sensitive to others' problems and Susan corresponds with knows, thus she is the primary pronoun. In the following sentence: 'Susan knows all about Ann's personal problems because she is nosy.' Which does 'she' more likely refer to, 'Susan' or 'Ann'?", "Given The pronoun probably refers to Susan who is a nosy person and so knows everything and Susan corresponds with knows, thus she is the primary pronoun. In the following sentence: 'Susan knows all about Ann's personal problems because she is nosy.' Which does 'she' more likely refer to, 'Susan' or 'Ann'?", "Given Sid would understand his own explanation and he couldn't understand himSid explained his theory to Mark. In the following sentence: 'Sid explained his theory to Mark but he couldn't understand him.' Which does 'he' more likely refer to, 'Sid' or 'Mark'?", "Given Sid would understand his own explanation and Sid was the the one explaining. In the following sentence: 'Sid explained his theory to Mark but he couldn't understand him.' Which does 'he' more likely refer to, 'Sid' or 'Mark'?", "Given he couldn't understand himSid explained his theory to Mark and Sid was the the one explaining. In the following sentence: 'Sid explained his theory to Mark but he couldn't understand him.' Which does 'he' more likely refer to, 'Sid' or 'Mark'?", "Given susan said the anne your son accident and she told ann's car accident to susan. In the following sentence: 'Susan knew that Ann's son had been in a car accident, so she told her about it.' Which does 'she' more likely refer to, 'Susan' or 'Ann'?", "Given susan said the anne your son accident and ann was informed about her son's car accident. In the following sentence: 'Susan knew that Ann's son had been in a car accident, so she told her about it.' Which does 'she' more likely refer to, 'Susan' or 'Ann'?", "Given she told ann's car accident to susan and ann was informed about her son's car accident. In the following sentence: 'Susan knew that Ann's son had been in a car accident, so she told her about it.' Which does 'she' more likely refer to, 'Susan' or 'Ann'?", "Given a drain with hair should be cleaned and The drain would need to be cleaned to remove the hair. In the following sentence: 'The drain is clogged with hair. It has to be cleaned.' Which does 'It' more likely refer to, 'The drain' or 'The hair'?", "Given a drain with hair should be cleaned and the hair has to be cleaned than only water drain properly. In the following sentence: 'The drain is clogged with hair. It has to be cleaned.' Which does 'It' more likely refer to, 'The drain' or 'The hair'?", "Given The drain would need to be cleaned to remove the hair and the hair has to be cleaned than only water drain properly. In the following sentence: 'The drain is clogged with hair. It has to be cleaned.' Which does 'It' more likely refer to, 'The drain' or 'The hair'?", "Given pillars are hard to be see through and The pillar is a solid object that is not transparent, and the stage is the target of vision. In the following sentence: 'There is a pillar between me and the stage, and I can't see around it .' Which does 'it' more likely refer to, 'The pillar' or 'The stage'?", "Given pillars are hard to be see through and I can't see because There is a pillar between me and the stage. In the following sentence: 'There is a pillar between me and the stage, and I can't see around it .' Which does 'it' more likely refer to, 'The pillar' or 'The stage'?", "Given The pillar is a solid object that is not transparent, and the stage is the target of vision and I can't see because There is a pillar between me and the stage. In the following sentence: 'There is a pillar between me and the stage, and I can't see around it .' Which does 'it' more likely refer to, 'The pillar' or 'The stage'?", "Given view of stage could be blocked by pillars and since the pillar is in the way they probably can't see the stage. In the following sentence: 'There is a pillar between me and the stage, and I can't see it .' Which does 'it' more likely refer to, 'The pillar' or 'The stage'?", "Given view of stage could be blocked by pillars and Actually, the red pronoun \"it\" refers to the stage, which is the target of vision that is blocked by the intervening pillar, which is visible. In the following sentence: 'There is a pillar between me and the stage, and I can't see it .' Which does 'it' more likely refer to, 'The pillar' or 'The stage'?", "Given since the pillar is in the way they probably can't see the stage and Actually, the red pronoun \"it\" refers to the stage, which is the target of vision that is blocked by the intervening pillar, which is visible. In the following sentence: 'There is a pillar between me and the stage, and I can't see it .' Which does 'it' more likely refer to, 'The pillar' or 'The stage'?", "Given people being asked could forget the answers and all info is waiting to be gotten from mary so she is the she. In the following sentence: 'Ann asked Mary what time the library closes, but she had forgotten.' Which does 'she' more likely refer to, 'Ann' or 'Mary'?", "Given people being asked could forget the answers and ann forgotten the time so she asked to mary. In the following sentence: 'Ann asked Mary what time the library closes, but she had forgotten.' Which does 'she' more likely refer to, 'Ann' or 'Mary'?", "Given all info is waiting to be gotten from mary so she is the she and ann forgotten the time so she asked to mary. In the following sentence: 'Ann asked Mary what time the library closes, but she had forgotten.' Which does 'she' more likely refer to, 'Ann' or 'Mary'?", "Given Charlie is the one who acts like it never happened and He is very ungrateful Bob paid for Charlie's college education, but now Charlie acts as though it never happened. In the following sentence: 'Bob paid for Charlie's college education, but now Charlie acts as though it never happened. He is very ungrateful.' Which does 'He' more likely refer to, 'Bob' or 'Charlie'?", "Given Charlie is the one who acts like it never happened and Charlie is ungrateful for not appreciating a help. In the following sentence: 'Bob paid for Charlie's college education, but now Charlie acts as though it never happened. He is very ungrateful.' Which does 'He' more likely refer to, 'Bob' or 'Charlie'?", "Given He is very ungrateful Bob paid for Charlie's college education, but now Charlie acts as though it never happened and Charlie is ungrateful for not appreciating a help. In the following sentence: 'Bob paid for Charlie's college education, but now Charlie acts as though it never happened. He is very ungrateful.' Which does 'He' more likely refer to, 'Bob' or 'Charlie'?", "Given animals feel hot move to cooler places and The dog moved, the spot under the tree did not. In the following sentence: 'It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree,  because it was cooler.' Which does 'it' more likely refer to, 'The dog' or 'The spot under the tree'?", "Given animals feel hot move to cooler places and The dog can go anywhere, likely to compare as movable object. In the following sentence: 'It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree,  because it was cooler.' Which does 'it' more likely refer to, 'The dog' or 'The spot under the tree'?", "Given The dog moved, the spot under the tree did not and The dog can go anywhere, likely to compare as movable object. In the following sentence: 'It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree,  because it was cooler.' Which does 'it' more likely refer to, 'The dog' or 'The spot under the tree'?", "Given The mouse would be the one in need of being cautious in this situation and The cautious animal is the one being hunted. In the following sentence: 'The cat was lying by the mouse hole waiting for the mouse, but it was too cautious.' Which does 'it' more likely refer to, 'The cat' or 'The mouse'?", "Given The mouse would be the one in need of being cautious in this situation and The mouse was aware of and avoiding the cat. In the following sentence: 'The cat was lying by the mouse hole waiting for the mouse, but it was too cautious.' Which does 'it' more likely refer to, 'The cat' or 'The mouse'?", "Given The cautious animal is the one being hunted and The mouse was aware of and avoiding the cat. In the following sentence: 'The cat was lying by the mouse hole waiting for the mouse, but it was too cautious.' Which does 'it' more likely refer to, 'The cat' or 'The mouse'?", "Given One would not repair a felled tree and the roof has the damage, and has to be repaired so it is referring to the roof. In the following sentence: 'In the storm, the tree fell down and crashed through the roof of my  house. Now, I have to get it repaired.' Which does 'it' more likely refer to, 'The tree' or 'The roof'?", "Given One would not repair a felled tree and the roof of house crashed and have to get it repaired. In the following sentence: 'In the storm, the tree fell down and crashed through the roof of my  house. Now, I have to get it repaired.' Which does 'it' more likely refer to, 'The tree' or 'The roof'?", "Given the roof has the damage, and has to be repaired so it is referring to the roof and the roof of house crashed and have to get it repaired. In the following sentence: 'In the storm, the tree fell down and crashed through the roof of my  house. Now, I have to get it repaired.' Which does 'it' more likely refer to, 'The tree' or 'The roof'?", "Given Jane was the one that got no answer at the door so it's logical she was disappointed and susan may not be at home. In the following sentence: 'Jane knocked on Susan's door, but there was no answer. She was disappointed.' Which does 'She' more likely refer to, 'Jane' or 'Susan'?", "Given Jane was the one that got no answer at the door so it's logical she was disappointed and Susan was disappointed because there is no answer. In the following sentence: 'Jane knocked on Susan's door, but there was no answer. She was disappointed.' Which does 'She' more likely refer to, 'Jane' or 'Susan'?", "Given susan may not be at home and Susan was disappointed because there is no answer. In the following sentence: 'Jane knocked on Susan's door, but there was no answer. She was disappointed.' Which does 'She' more likely refer to, 'Jane' or 'Susan'?", "Given Jane knocked on Susan's door but he is not response and susan's door was no answer she was out. In the following sentence: 'Jane knocked on Susan's door, but there was no answer. She was out.' Which does 'She' more likely refer to, 'Jane' or 'Susan'?", "Given Jane knocked on Susan's door but he is not response and susan's was not responding while her door was knocked by jane. In the following sentence: 'Jane knocked on Susan's door, but there was no answer. She was out.' Which does 'She' more likely refer to, 'Jane' or 'Susan'?", "Given susan's door was no answer she was out and susan's was not responding while her door was knocked by jane. In the following sentence: 'Jane knocked on Susan's door, but there was no answer. She was out.' Which does 'She' more likely refer to, 'Jane' or 'Susan'?", "Given Jane is the person visiting and knocking on the door Susan would invite her in and Susan was was the one inside. In the following sentence: 'Jane knocked on the door, and Susan answered it. She invited her to come in.' Which does 'She' more likely refer to, 'Jane' or 'Susan'?", "Given Jane is the person visiting and knocking on the door Susan would invite her in and because jane was the one inside. In the following sentence: 'Jane knocked on the door, and Susan answered it. She invited her to come in.' Which does 'She' more likely refer to, 'Jane' or 'Susan'?", "Given Susan was was the one inside and because jane was the one inside. In the following sentence: 'Jane knocked on the door, and Susan answered it. She invited her to come in.' Which does 'She' more likely refer to, 'Jane' or 'Susan'?", "Given the sun is the thing being covered, so \"it\" is out when it is no longer covered The cloud can't cover itself and a thick cloud all morning, but luckily the sun was covered. In the following sentence: 'The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, it was out.' Which does 'it' more likely refer to, 'The sun' or 'The cloud'?", "Given the sun is the thing being covered, so \"it\" is out when it is no longer covered The cloud can't cover itself and The sun being out is a common expression. In the following sentence: 'The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, it was out.' Which does 'it' more likely refer to, 'The sun' or 'The cloud'?", "Given a thick cloud all morning, but luckily the sun was covered and The sun being out is a common expression. In the following sentence: 'The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, it was out.' Which does 'it' more likely refer to, 'The sun' or 'The cloud'?", "Given The pronoun is likely to refer to sheep because they look more like dogs and sheep is an animal, it can vary while drawn by different persons. In the following sentence: 'Sam tried to paint a picture of shepherds with sheep, but they ended up looking more like dogs.' Which does 'they' more likely refer to, 'The shepherds' or 'The sheep'?", "Given The pronoun is likely to refer to sheep because they look more like dogs and paint a pictured like dogs. In the following sentence: 'Sam tried to paint a picture of shepherds with sheep, but they ended up looking more like dogs.' Which does 'they' more likely refer to, 'The shepherds' or 'The sheep'?", "Given sheep is an animal, it can vary while drawn by different persons and paint a pictured like dogs. In the following sentence: 'Sam tried to paint a picture of shepherds with sheep, but they ended up looking more like dogs.' Which does 'they' more likely refer to, 'The shepherds' or 'The sheep'?", "Given they had had very warm down coats and The coats have no perception of cold or how prepared they are. In the following sentence: 'Fred and Alice had very warm down coats, but they were not prepared for the cold in Alaska.' Which does 'they' more likely refer to, 'Fred and Alice' or 'coats'?", "Given they had had very warm down coats and fred and alice are the ones with the warm coats and aren't still ready for the weather. In the following sentence: 'Fred and Alice had very warm down coats, but they were not prepared for the cold in Alaska.' Which does 'they' more likely refer to, 'Fred and Alice' or 'coats'?", "Given The coats have no perception of cold or how prepared they are and fred and alice are the ones with the warm coats and aren't still ready for the weather. In the following sentence: 'Fred and Alice had very warm down coats, but they were not prepared for the cold in Alaska.' Which does 'they' more likely refer to, 'Fred and Alice' or 'coats'?", "Given The foxes were attacking which would be bold and they dare to attack. In the following sentence: 'The foxes are getting in at night and attacking the chickens. They have gotten very bold.' Which does 'They' more likely refer to, 'The foxes' or 'The chickens'?", "Given The foxes were attacking which would be bold and the foxes are the aggressors, so the sentence is referring to the foxes as getting bold. In the following sentence: 'The foxes are getting in at night and attacking the chickens. They have gotten very bold.' Which does 'They' more likely refer to, 'The foxes' or 'The chickens'?", "Given they dare to attack and the foxes are the aggressors, so the sentence is referring to the foxes as getting bold. In the following sentence: 'The foxes are getting in at night and attacking the chickens. They have gotten very bold.' Which does 'They' more likely refer to, 'The foxes' or 'The chickens'?", "Given Tina is easy to pronounce and More likely to refer to Tina because Tina is the easier of the two to pronounce. In the following sentence: 'The actress used to be named Terpsichore, but she changed it to Tina a  few years ago, because she figured it was easier to pronounce.' Which does 'it' more likely refer to, 'Terpsichore' or 'Tina'?", "Given Tina is easy to pronounce and It refers to Tina because that is the shorter name. In the following sentence: 'The actress used to be named Terpsichore, but she changed it to Tina a  few years ago, because she figured it was easier to pronounce.' Which does 'it' more likely refer to, 'Terpsichore' or 'Tina'?", "Given More likely to refer to Tina because Tina is the easier of the two to pronounce and It refers to Tina because that is the shorter name. In the following sentence: 'The actress used to be named Terpsichore, but she changed it to Tina a  few years ago, because she figured it was easier to pronounce.' Which does 'it' more likely refer to, 'Terpsichore' or 'Tina'?", "Given Yakusk had a bigger and better army Kamtchatka didn't So Kamtchatka lost and The sentance describes who lost, and why Yakutsk had advantages. In the following sentence: 'In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much  better equipped and ten times larger, they were defeated within weeks.' Which does 'they' more likely refer to, 'Kamtchatka' or 'Yakutsk'?", "Given Yakusk had a bigger and better army Kamtchatka didn't So Kamtchatka lost and Yakutsk had the larger better equipped army therefore they were winners. In the following sentence: 'In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much  better equipped and ten times larger, they were defeated within weeks.' Which does 'they' more likely refer to, 'Kamtchatka' or 'Yakutsk'?", "Given The sentance describes who lost, and why Yakutsk had advantages and Yakutsk had the larger better equipped army therefore they were winners. In the following sentence: 'In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much  better equipped and ten times larger, they were defeated within weeks.' Which does 'they' more likely refer to, 'Kamtchatka' or 'Yakutsk'?", "Given The minnow is the one likely to be in danger compared to the duck and the one in need of going away to safety and Duck was above minnow as minnow was swimming below the duck. In the following sentence: 'Look! There is a minnow swimming right below that duck! It had better get away to safety fast!' Which does 'It' more likely refer to, 'The minnow' or 'The duck'?", "Given The minnow is the one likely to be in danger compared to the duck and the one in need of going away to safety and Safety is better in Swimming right below the duck. In the following sentence: 'Look! There is a minnow swimming right below that duck! It had better get away to safety fast!' Which does 'It' more likely refer to, 'The minnow' or 'The duck'?", "Given Duck was above minnow as minnow was swimming below the duck and Safety is better in Swimming right below the duck. In the following sentence: 'Look! There is a minnow swimming right below that duck! It had better get away to safety fast!' Which does 'It' more likely refer to, 'The minnow' or 'The duck'?", "Given archaeologists are the one doing the research so they are the ones hunting for evidence and The early humans would not have been hunting for evidence about themselves. In the following sentence: 'Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for evidence on the river banks.' Which does 'They' more likely refer to, 'Archaeologists' or 'Prehistoric humans'?", "Given archaeologists are the one doing the research so they are the ones hunting for evidence and Because Archaeologists were te ones looking for the evidence. In the following sentence: 'Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for evidence on the river banks.' Which does 'They' more likely refer to, 'Archaeologists' or 'Prehistoric humans'?", "Given The early humans would not have been hunting for evidence about themselves and Because Archaeologists were te ones looking for the evidence. In the following sentence: 'Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for evidence on the river banks.' Which does 'They' more likely refer to, 'Archaeologists' or 'Prehistoric humans'?", "Given Archaeologists wouldn't likely be the ones hunting for deer and 20000 years ago,deer hunting was the main source of food. In the following sentence: 'Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for deer on the river banks.' Which does 'They' more likely refer to, 'Archaeologists' or 'Prehistoric humans'?", "Given Archaeologists wouldn't likely be the ones hunting for deer and the archaelogists did research. In the following sentence: 'Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for deer on the river banks.' Which does 'They' more likely refer to, 'Archaeologists' or 'Prehistoric humans'?", "Given 20000 years ago,deer hunting was the main source of food and the archaelogists did research. In the following sentence: 'Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for deer on the river banks.' Which does 'They' more likely refer to, 'Archaeologists' or 'Prehistoric humans'?", "Given The police would be stopping the drug trade, the gang would not and gang members don't stop drug trading. In the following sentence: 'The police arrested all of the gang members. They were trying to stop the drug trade in the neighborhood.' Which does 'They' more likely refer to, 'The police' or 'The gang members'?", "Given The police would be stopping the drug trade, the gang would not and the police trying to stop the drug trade. In the following sentence: 'The police arrested all of the gang members. They were trying to stop the drug trade in the neighborhood.' Which does 'They' more likely refer to, 'The police' or 'The gang members'?", "Given gang members don't stop drug trading and the police trying to stop the drug trade. In the following sentence: 'The police arrested all of the gang members. They were trying to stop the drug trade in the neighborhood.' Which does 'They' more likely refer to, 'The police' or 'The gang members'?", "Given If everyone loved the oatmeal cookies, why make more of the chocolate chip that few liked? and Why would one make fewer of the more popular cookie?. In the following sentence: 'Everyone really loved the oatmeal cookies; only a few people liked the  chocolate chip cookies. Next time, we should make fewer of them .' Which does 'them' more likely refer to, 'The oatmeal cookies' or 'The chocolate chip cookies'?", "Given If everyone loved the oatmeal cookies, why make more of the chocolate chip that few liked? and You would need more oatmeal cookies not fewer. In the following sentence: 'Everyone really loved the oatmeal cookies; only a few people liked the  chocolate chip cookies. Next time, we should make fewer of them .' Which does 'them' more likely refer to, 'The oatmeal cookies' or 'The chocolate chip cookies'?", "Given Why would one make fewer of the more popular cookie? and You would need more oatmeal cookies not fewer. In the following sentence: 'Everyone really loved the oatmeal cookies; only a few people liked the  chocolate chip cookies. Next time, we should make fewer of them .' Which does 'them' more likely refer to, 'The oatmeal cookies' or 'The chocolate chip cookies'?", "Given They stabbed the carrot Logically a hole would be left and The carrot is the thing that was poked, not the pin. In the following sentence: 'I stuck a pin through a carrot. When I pulled the pin out, it had a hole.' Which does 'it' more likely refer to, 'The pin' or 'The carrot'?", "Given They stabbed the carrot Logically a hole would be left and The carrot was being stuck by the pin; therefore it would have the hole. In the following sentence: 'I stuck a pin through a carrot. When I pulled the pin out, it had a hole.' Which does 'it' more likely refer to, 'The pin' or 'The carrot'?", "Given The carrot is the thing that was poked, not the pin and The carrot was being stuck by the pin; therefore it would have the hole. In the following sentence: 'I stuck a pin through a carrot. When I pulled the pin out, it had a hole.' Which does 'it' more likely refer to, 'The pin' or 'The carrot'?", "Given The coffee is already full, so you assume its the pen and THe sentence refers to the thing they used to stir. In the following sentence: 'I couldn't find a spoon, so I tried using a pen to stir my  coffee. But that turned out to be a bad idea, because it got full of coffee.' Which does 'it' more likely refer to, 'The pen' or 'The coffee'?", "Given The coffee is already full, so you assume its the pen and The pen was put into the coffee: therefore it would be the object getting coffee in it. In the following sentence: 'I couldn't find a spoon, so I tried using a pen to stir my  coffee. But that turned out to be a bad idea, because it got full of coffee.' Which does 'it' more likely refer to, 'The pen' or 'The coffee'?", "Given THe sentence refers to the thing they used to stir and The pen was put into the coffee: therefore it would be the object getting coffee in it. In the following sentence: 'I couldn't find a spoon, so I tried using a pen to stir my  coffee. But that turned out to be a bad idea, because it got full of coffee.' Which does 'it' more likely refer to, 'The pen' or 'The coffee'?", "Given Tom was taking the action to take the bishop and would be putting the King in check and he lost his bishop. In the following sentence: 'Tom said \"Check\" to Ralph as he took his bishop.' Which does 'his' more likely refer to, 'Tom' or 'Ralph'?", "Given Tom was taking the action to take the bishop and would be putting the King in check and Ralph was told to check as he took his bishop. In the following sentence: 'Tom said \"Check\" to Ralph as he took his bishop.' Which does 'his' more likely refer to, 'Tom' or 'Ralph'?", "Given he lost his bishop and Ralph was told to check as he took his bishop. In the following sentence: 'Tom said \"Check\" to Ralph as he took his bishop.' Which does 'his' more likely refer to, 'Tom' or 'Ralph'?", "Given His turn was over and the turn of bill is over so he gave it to john. In the following sentence: 'Bill passed the gameboy to John because his turn was over.' Which does 'his' more likely refer to, 'Bill' or 'John'?", "Given His turn was over and the sentence was about bills action to pass the gameboy so his is referencing bill. In the following sentence: 'Bill passed the gameboy to John because his turn was over.' Which does 'his' more likely refer to, 'Bill' or 'John'?", "Given the turn of bill is over so he gave it to john and the sentence was about bills action to pass the gameboy so his is referencing bill. In the following sentence: 'Bill passed the gameboy to John because his turn was over.' Which does 'his' more likely refer to, 'Bill' or 'John'?", "Given Lily starting a conversation with Donna it is likely to break Donna's concentration and Donna was the one trying to concentrate. In the following sentence: 'Lily spoke to Donna, breaking her concentration.' Which does 'her' more likely refer to, 'Lily' or 'Donna'?", "Given Lily starting a conversation with Donna it is likely to break Donna's concentration and breaking her concentrationLily spoke to Donna. In the following sentence: 'Lily spoke to Donna, breaking her concentration.' Which does 'her' more likely refer to, 'Lily' or 'Donna'?", "Given Donna was the one trying to concentrate and breaking her concentrationLily spoke to Donna. In the following sentence: 'Lily spoke to Donna, breaking her concentration.' Which does 'her' more likely refer to, 'Lily' or 'Donna'?", "Given Tommy would be upset about dropping his ice cream and the upset son deserves a sympathetic look from father. In the following sentence: 'When Tommy dropped his ice cream, Timmy giggled, so father gave him a sympathetic look.' Which does 'him' more likely refer to, 'Tommy' or 'Timmy'?", "Given Tommy would be upset about dropping his ice cream and Because he had dropped the ice cream and felt bad deserving sympathy. In the following sentence: 'When Tommy dropped his ice cream, Timmy giggled, so father gave him a sympathetic look.' Which does 'him' more likely refer to, 'Tommy' or 'Timmy'?", "Given the upset son deserves a sympathetic look from father and Because he had dropped the ice cream and felt bad deserving sympathy. In the following sentence: 'When Tommy dropped his ice cream, Timmy giggled, so father gave him a sympathetic look.' Which does 'him' more likely refer to, 'Tommy' or 'Timmy'?", "Given A bassinet is a cradle, it makes more sense the sleeping boy is carried to his bed and The father would not sleep in a childs bassinet. In the following sentence: 'The father carried the sleeping boy in his bassinet.' Which does 'his' more likely refer to, 'The father' or 'The boy'?", "Given A bassinet is a cradle, it makes more sense the sleeping boy is carried to his bed and The father is carrying the bassinet; the boy is in the bassinet. In the following sentence: 'The father carried the sleeping boy in his bassinet.' Which does 'his' more likely refer to, 'The father' or 'The boy'?", "Given The father would not sleep in a childs bassinet and The father is carrying the bassinet; the boy is in the bassinet. In the following sentence: 'The father carried the sleeping boy in his bassinet.' Which does 'his' more likely refer to, 'The father' or 'The boy'?", "Given \"held\" is the action the woman is taking, she can't hold herself against her own chest and You can't hold someone against their own chest. In the following sentence: 'The woman held the girl against her chest' Which does 'her' more likely refer to, 'The woman' or 'The girl'?", "Given \"held\" is the action the woman is taking, she can't hold herself against her own chest and the women against girl chest. In the following sentence: 'The woman held the girl against her chest' Which does 'her' more likely refer to, 'The woman' or 'The girl'?", "Given You can't hold someone against their own chest and the women against girl chest. In the following sentence: 'The woman held the girl against her chest' Which does 'her' more likely refer to, 'The woman' or 'The girl'?", "Given Pam and Paul were the ones caught So you assume they would be embarrassed and Paul wouldnt be embarrassed, he was getting laid!. In the following sentence: 'Pam's parents came home and found her having sex with her boyfriend, Paul. They were embarrassed about it.' Which does 'They' more likely refer to, 'Pam's parents' or 'Pam and Paul'?", "Given Pam and Paul were the ones caught So you assume they would be embarrassed and Pam's parents were embarrassed while seeing the Pam's behaviour with her boyfriend. In the following sentence: 'Pam's parents came home and found her having sex with her boyfriend, Paul. They were embarrassed about it.' Which does 'They' more likely refer to, 'Pam's parents' or 'Pam and Paul'?", "Given Paul wouldnt be embarrassed, he was getting laid! and Pam's parents were embarrassed while seeing the Pam's behaviour with her boyfriend. In the following sentence: 'Pam's parents came home and found her having sex with her boyfriend, Paul. They were embarrassed about it.' Which does 'They' more likely refer to, 'Pam's parents' or 'Pam and Paul'?", "Given Lemons are round so it wouldn't make sense So you assume its the trees and A lemon by itsself wouldnt look like a pole (hopefully)!. In the following sentence: 'I tried to paint a picture of an orchard, with lemons in the lemon trees,  but they came out looking more like telephone poles.' Which does 'they' more likely refer to, 'lemons' or 'lemon trees'?", "Given Lemons are round so it wouldn't make sense So you assume its the trees and Lemons in the lemon trees, but they came out looking more like telephone poles. In the following sentence: 'I tried to paint a picture of an orchard, with lemons in the lemon trees,  but they came out looking more like telephone poles.' Which does 'they' more likely refer to, 'lemons' or 'lemon trees'?", "Given A lemon by itsself wouldnt look like a pole (hopefully)! and Lemons in the lemon trees, but they came out looking more like telephone poles. In the following sentence: 'I tried to paint a picture of an orchard, with lemons in the lemon trees,  but they came out looking more like telephone poles.' Which does 'they' more likely refer to, 'lemons' or 'lemon trees'?", "Given A butterfly wing would likely not be heavy enough to break a table and it's delicate. In the following sentence: 'I put the butterfly wing on the table and it broke.' Which does 'it' more likely refer to, 'The butterfly wing' or 'The table'?", "Given A butterfly wing would likely not be heavy enough to break a table and the table would not break from a butterfly wing. In the following sentence: 'I put the butterfly wing on the table and it broke.' Which does 'it' more likely refer to, 'The butterfly wing' or 'The table'?", "Given it's delicate and the table would not break from a butterfly wing. In the following sentence: 'I put the butterfly wing on the table and it broke.' Which does 'it' more likely refer to, 'The butterfly wing' or 'The table'?"]