{"Joan made sure to thank Susan for all the help she had given.": ["Joan", "Susan"], "Paul tried to call George on the phone, but he wasn't successful.": ["Paul", "George"], "Paul tried to call George on the phone, but he wasn't available.": ["Paul", "George"], "The lawyer asked the witness a question, but he was reluctant to repeat it.": ["the lawyer", "the witness"], "Frank felt vindicated when his longtime rival Bill revealed that he was the winner of the competition.": ["Frank", "Bill"], "The man couldn't lift his son because he was so heavy.": ["The man", "The son"], "The large ball crashed right through the table because it was made of styrofoam.": ["The large ball", "The table"], "John couldn't see the stage with Billy in front of him because he is so short.": ["John", "Billy"], "Tom threw his schoolbag down to Ray after he reached the top of the stairs.": ["Tom", "Ray"], "Although they ran at about the same speed, Sue beat Sally because she had such a good start.": ["Sue", "Sally"], "The sculpture rolled off the shelf because it wasn't level.": ["The sculpture", "The shelf"], "Frank was upset with Tom because the toaster he had bought from him didn't work.": ["Frank", "Tom"], "Jim yelled at Kevin because he was so upset.": ["Jim", "Kevin"], "The sack of potatoes had been placed above the bag of flour, so it had to be moved first.": ["The sack of potatoes", "The bag of flour"], "Pete envies Martin although he is very successful.": ["Pete", "Martin"], "Pete envies Martin because he is very successful.": ["Pete", "Martin"], "I poured water from the bottle into the cup until it was empty.": ["the bottle", "the cup"], "I poured water from the bottle into the cup until it was full.": ["the bottle", "the cup"], "Susan knows all about Ann's personal problems because she is nosy.": ["Susan", "Ann"], "Sid explained his theory to Mark but he couldn't understand him.": ["Sid", "Mark"], "Susan knew that Ann's son had been in a car accident, so she told her about it.": ["Susan", "Ann"], "The drain is clogged with hair. It has to be cleaned.": ["The drain", "The hair"], "There is a pillar between me and the stage, and I can't see around it .": ["The pillar", "The stage"], "There is a pillar between me and the stage, and I can't see it .": ["The pillar", "The stage"], "Ann asked Mary what time the library closes, but she had forgotten.": ["Ann", "Mary"], "Bob paid for Charlie's college education, but now Charlie acts as though it never happened. He is very ungrateful.": ["Bob", "Charlie"], "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree,  because it was cooler.": ["The dog", "The spot under the tree"], "The cat was lying by the mouse hole waiting for the mouse, but it was too cautious.": ["The cat", "The mouse"], "In the storm, the tree fell down and crashed through the roof of my  house. Now, I have to get it repaired.": ["The tree", "The roof"], "Jane knocked on Susan's door, but there was no answer. She was disappointed.": ["Jane", "Susan"], "Jane knocked on Susan's door, but there was no answer. She was out.": ["Jane", "Susan"], "Jane knocked on the door, and Susan answered it. She invited her to come in.": ["Jane", "Susan"], "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, it was out.": ["The sun", "The cloud"], "Sam tried to paint a picture of shepherds with sheep, but they ended up looking more like dogs.": ["The shepherds", "The sheep"], "Fred and Alice had very warm down coats, but they were not prepared for the cold in Alaska.": ["Fred and Alice", "coats"], "The foxes are getting in at night and attacking the chickens. They have gotten very bold.": ["The foxes", "The chickens"], "The actress used to be named Terpsichore, but she changed it to Tina a  few years ago, because she figured it was easier to pronounce.": ["Terpsichore", "Tina"], "In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much  better equipped and ten times larger, they were defeated within weeks.": ["Kamtchatka", "Yakutsk"], "Look! There is a minnow swimming right below that duck! It had better get away to safety fast!": ["The minnow", "The duck"], "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for evidence on the river banks.": ["Archaeologists", "Prehistoric humans"], "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. They hunted for deer on the river banks.": ["Archaeologists", "Prehistoric humans"], "The police arrested all of the gang members. They were trying to stop the drug trade in the neighborhood.": ["The police", "The gang members"], "Everyone really loved the oatmeal cookies; only a few people liked the  chocolate chip cookies. Next time, we should make fewer of them .": ["The oatmeal cookies", "The chocolate chip cookies"], "I stuck a pin through a carrot. When I pulled the pin out, it had a hole.": ["The pin", "The carrot"], "I couldn't find a spoon, so I tried using a pen to stir my  coffee. But that turned out to be a bad idea, because it got full of coffee.": ["The pen", "The coffee"], "Tom said \"Check\" to Ralph as he took his bishop.": ["Tom", "Ralph"], "Bill passed the gameboy to John because his turn was over.": ["Bill", "John"], "Lily spoke to Donna, breaking her concentration.": ["Lily", "Donna"], "When Tommy dropped his ice cream, Timmy giggled, so father gave him a sympathetic look.": ["Tommy", "Timmy"], "The father carried the sleeping boy in his bassinet.": ["The father", "The boy"], "The woman held the girl against her chest": ["The woman", "The girl"], "Pam's parents came home and found her having sex with her boyfriend, Paul. They were embarrassed about it.": ["Pam's parents", "Pam and Paul"], "I tried to paint a picture of an orchard, with lemons in the lemon trees,  but they came out looking more like telephone poles.": ["lemons", "lemon trees"], "I put the butterfly wing on the table and it broke.": ["The butterfly wing", "The table"]}